Revit 2024 API
SolidOptions.ExtraFaceAndEdgeHistoryKey Property
 Optional extra key used to create face and edge histories for the Solid. If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public int ExtraFaceAndEdgeHistoryKey { get; set; }
Visual Basic
Public Property ExtraFaceAndEdgeHistoryKey As Integer
	Get
	Set
Visual C++
public:
property int ExtraFaceAndEdgeHistoryKey {
	int get ();
	void set (int value);
}
See Also
SolidOptions Class
Autodesk.Revit.DB Namespace